In [10]:
import pandas as pd
import numpy as np
print(pd.__version__)

2.2.2

In [11]:
data={"name":["jamal","hasan","korim"],
      "Roll":[30,None,40],
      "good":["y",np.nan,"N"]
     }
df=pd.DataFrame(data)
df

    name  Roll good
0  jamal  30.0    y
1  hasan   NaN  NaN
2  korim  40.0    N

In [12]:
df["Roll"]=df["Roll"].fillna(method="ffill",inplace=False)
df

C:\Users\mosta\AppData\Local\Temp\ipykernel_13596\1818335313.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Roll"]=df["Roll"].fillna(method="ffill",inplace=False)

    name  Roll good
0  jamal  30.0    y
1  hasan  30.0  NaN
2  korim  40.0    N

In [8]:
df

    name  Roll  good
0  jamal  30.0     y
1  hasan  30.0  None
2  korim  40.0     N

In [14]:
df=df.bfill(axis=0)
df

    name  Roll good
0  jamal  30.0    y
1  hasan  30.0    N
2  korim  40.0    N